GopalSaraf/Practicals/PSDL/include/proc/pic18lf4585.inc
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LVDEN                            BANKMASK(HLVDCON), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(HLVDCON), 0, a
#define LVDL1                            BANKMASK(HLVDCON), 1, a
#define LVDL2                            BANKMASK(HLVDCON), 2, a
#define LVDL3                            BANKMASK(HLVDCON), 3, a
#define LVV0                             BANKMASK(HLVDCON), 0, a
#define LVV1                             BANKMASK(HLVDCON), 1, a
#define LVV2                             BANKMASK(HLVDCON), 2, a
#define LVV3                             BANKMASK(HLVDCON), 3, a
#define MDSEL0                           BANKMASK(ECANCON), 6, a
#define MDSEL1                           BANKMASK(ECANCON), 7, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSPSTAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSPSTAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_FIFOEMPTY                    BANKMASK(COMSTAT), 7, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_SS                           BANKMASK(PORTA), 5, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_W                            BANKMASK(SSPSTAT), 2, a
#define NOT_WRITE                        BANKMASK(SSPSTAT), 2, a
#define OBF                              BANKMASK(TRISE), 6, a
#define OERR                             BANKMASK(RCSTA), 1, a
#define OSC1                             BANKMASK(PORTA), 7, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1A                              BANKMASK(PORTD), 4, a
#define P1B                              BANKMASK(PORTD), 5, a
#define P1C                              BANKMASK(PORTD), 6, a
#define P1D                              BANKMASK(PORTD), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ADCON1), 0, a
#define PCFG1                            BANKMASK(ADCON1), 1, a
#define PCFG2                            BANKMASK(ADCON1), 2, a
#define PCFG3                            BANKMASK(ADCON1), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PDC0                             BANKMASK(ECCP1DEL), 0, a
#define PDC1                             BANKMASK(ECCP1DEL), 1, a
#define PDC2                             BANKMASK(ECCP1DEL), 2, a
#define PDC3                             BANKMASK(ECCP1DEL), 3, a
#define PDC4                             BANKMASK(ECCP1DEL), 4, a
#define PDC5                             BANKMASK(ECCP1DEL), 5, a
#define PDC6                             BANKMASK(ECCP1DEL), 6, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSPCON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PGM                              BANKMASK(PORTB), 5, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define POR                              BANKMASK(RCON), 1, a
#define PRSEG0                           BANKMASK(BRGCON2), 0, a
#define PRSEG1                           BANKMASK(BRGCON2), 1, a
#define PRSEG2                           BANKMASK(BRGCON2), 2, a
#define PRSEN                            BANKMASK(ECCP1DEL), 7, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSP0                             BANKMASK(PORTD), 0, a
#define PSP1                             BANKMASK(PORTD), 1, a
#define PSP2                             BANKMASK(PORTD), 2, a
#define PSP3                             BANKMASK(PORTD), 3, a
#define PSP4                             BANKMASK(PORTD), 4, a
#define PSP5                             BANKMASK(PORTD), 5, a
#define PSP6                             BANKMASK(PORTD), 6, a
#define PSP7                             BANKMASK(PORTD), 7, a
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSPMODE                          BANKMASK(TRISE), 4, a
#define PSSAC0                           BANKMASK(ECCP1AS), 2, a
#define PSSAC1                           BANKMASK(ECCP1AS), 3, a
#define PSSBD0                           BANKMASK(ECCP1AS), 0, a
#define PSSBD1                           BANKMASK(ECCP1AS), 1, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC8_9                            BANKMASK(RCSTA), 6, a
#define RC9                              BANKMASK(RCSTA), 6, a
#define RCD8                             BANKMASK(RCSTA), 0, a
#define RCEN                             BANKMASK(SSPCON2), 3, a
#define RCIDL                            BANKMASK(BAUDCON), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RE3                              BANKMASK(PORTE), 3, a
#define READ_WRITE                       BANKMASK(SSPSTAT), 2, a
#define REC0                             BANKMASK(RXERRCNT), 0, a
#define REC1                             BANKMASK(RXERRCNT), 1, a
#define REC2                             BANKMASK(RXERRCNT), 2, a
#define REC3                             BANKMASK(RXERRCNT), 3, a
#define REC4                             BANKMASK(RXERRCNT), 4, a
#define REC5                             BANKMASK(RXERRCNT), 5, a
#define REC6                             BANKMASK(RXERRCNT), 6, a
#define REC7                             BANKMASK(RXERRCNT), 7, a
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RSEN                             BANKMASK(SSPCON2), 1, a
#define RW                               BANKMASK(SSPSTAT), 2, a
#define RX                               BANKMASK(PORTC), 7, a
#define RX9                              BANKMASK(RCSTA), 6, a
#define RX9D                             BANKMASK(RCSTA), 0, a
#define RXB0D00                          BANKMASK(RXB0D0), 0, a
#define RXB0D01                          BANKMASK(RXB0D0), 1, a
#define RXB0D02                          BANKMASK(RXB0D0), 2, a
#define RXB0D03                          BANKMASK(RXB0D0), 3, a
#define RXB0D04                          BANKMASK(RXB0D0), 4, a
#define RXB0D05                          BANKMASK(RXB0D0), 5, a
#define RXB0D06                          BANKMASK(RXB0D0), 6, a
#define RXB0D07                          BANKMASK(RXB0D0), 7, a
#define RXB0D10                          BANKMASK(RXB0D1), 0, a
#define RXB0D11                          BANKMASK(RXB0D1), 1, a
#define RXB0D12                          BANKMASK(RXB0D1), 2, a
#define RXB0D13                          BANKMASK(RXB0D1), 3, a
#define RXB0D14                          BANKMASK(RXB0D1), 4, a
#define RXB0D15                          BANKMASK(RXB0D1), 5, a
#define RXB0D16                          BANKMASK(RXB0D1), 6, a
#define RXB0D17                          BANKMASK(RXB0D1), 7, a
#define RXB0D20                          BANKMASK(RXB0D2), 0, a
#define RXB0D21                          BANKMASK(RXB0D2), 1, a
#define RXB0D22                          BANKMASK(RXB0D2), 2, a
#define RXB0D23                          BANKMASK(RXB0D2), 3, a
#define RXB0D24                          BANKMASK(RXB0D2), 4, a
#define RXB0D25                          BANKMASK(RXB0D2), 5, a
#define RXB0D26                          BANKMASK(RXB0D2), 6, a
#define RXB0D27                          BANKMASK(RXB0D2), 7, a
#define RXB0D30                          BANKMASK(RXB0D3), 0, a
#define RXB0D31                          BANKMASK(RXB0D3), 1, a
#define RXB0D32                          BANKMASK(RXB0D3), 2, a
#define RXB0D33                          BANKMASK(RXB0D3), 3, a
#define RXB0D34                          BANKMASK(RXB0D3), 4, a
#define RXB0D35                          BANKMASK(RXB0D3), 5, a
#define RXB0D36                          BANKMASK(RXB0D3), 6, a
#define RXB0D37                          BANKMASK(RXB0D3), 7, a
#define RXB0D40                          BANKMASK(RXB0D4), 0, a
#define RXB0D41                          BANKMASK(RXB0D4), 1, a
#define RXB0D42                          BANKMASK(RXB0D4), 2, a
#define RXB0D43                          BANKMASK(RXB0D4), 3, a
#define RXB0D44                          BANKMASK(RXB0D4), 4, a
#define RXB0D45                          BANKMASK(RXB0D4), 5, a
#define RXB0D46                          BANKMASK(RXB0D4), 6, a
#define RXB0D47                          BANKMASK(RXB0D4), 7, a
#define RXB0D50                          BANKMASK(RXB0D5), 0, a
#define RXB0D51                          BANKMASK(RXB0D5), 1, a
#define RXB0D52                          BANKMASK(RXB0D5), 2, a
#define RXB0D53                          BANKMASK(RXB0D5), 3, a
#define RXB0D54                          BANKMASK(RXB0D5), 4, a
#define RXB0D55                          BANKMASK(RXB0D5), 5, a
#define RXB0D56                          BANKMASK(RXB0D5), 6, a
#define RXB0D57                          BANKMASK(RXB0D5), 7, a
#define RXB0D60                          BANKMASK(RXB0D6), 0, a
#define RXB0D61                          BANKMASK(RXB0D6), 1, a
#define RXB0D62                          BANKMASK(RXB0D6), 2, a
#define RXB0D63                          BANKMASK(RXB0D6), 3, a
#define RXB0D64                          BANKMASK(RXB0D6), 4, a
#define RXB0D65                          BANKMASK(RXB0D6), 5, a
#define RXB0D66                          BANKMASK(RXB0D6), 6, a
#define RXB0D67                          BANKMASK(RXB0D6), 7, a
#define RXB0D70                          BANKMASK(RXB0D7), 0, a
#define RXB0D71                          BANKMASK(RXB0D7), 1, a
#define RXB0D72                          BANKMASK(RXB0D7), 2, a
#define RXB0D73                          BANKMASK(RXB0D7), 3, a
#define RXB0D74                          BANKMASK(RXB0D7), 4, a
#define RXB0D75                          BANKMASK(RXB0D7), 5, a
#define RXB0D76                          BANKMASK(RXB0D7), 6, a
#define RXB0D77                          BANKMASK(RXB0D7), 7, a
#define RXB0DBEN                         BANKMASK(RXB0CON), 2, a
#define RXB0DBEN_FILHIT2                 BANKMASK(RXB0CON), 2, a
#define RXB0DLC0                         BANKMASK(RXB0DLC), 0, a
#define RXB0DLC1                         BANKMASK(RXB0DLC), 1, a
#define RXB0DLC2                         BANKMASK(RXB0DLC), 2, a
#define RXB0DLC3                         BANKMASK(RXB0DLC), 3, a
#define RXB0EID0                         BANKMASK(RXB0EIDL), 0, a
#define RXB0EID1                         BANKMASK(RXB0EIDL), 1, a
#define RXB0EID10                        BANKMASK(RXB0EIDH), 2, a
#define RXB0EID11                        BANKMASK(RXB0EIDH), 3, a
#define RXB0EID12                        BANKMASK(RXB0EIDH), 4, a
#define RXB0EID13                        BANKMASK(RXB0EIDH), 5, a
#define RXB0EID14                        BANKMASK(RXB0EIDH), 6, a
#define RXB0EID15                        BANKMASK(RXB0EIDH), 7, a
#define RXB0EID16                        BANKMASK(RXB0SIDL), 0, a
#define RXB0EID17                        BANKMASK(RXB0SIDL), 1, a
#define RXB0EID2                         BANKMASK(RXB0EIDL), 2, a
#define RXB0EID3                         BANKMASK(RXB0EIDL), 3, a
#define RXB0EID4                         BANKMASK(RXB0EIDL), 4, a
#define RXB0EID5                         BANKMASK(RXB0EIDL), 5, a
#define RXB0EID6                         BANKMASK(RXB0EIDL), 6, a
#define RXB0EID7                         BANKMASK(RXB0EIDL), 7, a
#define RXB0EID8                         BANKMASK(RXB0EIDH), 0, a
#define RXB0EID9                         BANKMASK(RXB0EIDH), 1, a
#define RXB0EXID                         BANKMASK(RXB0SIDL), 3, a
#define RXB0FILHIT0                      BANKMASK(RXB0CON), 0, a
#define RXB0FILHIT1                      BANKMASK(RXB0CON), 1, a
#define RXB0FILHIT2                      BANKMASK(RXB0CON), 2, a
#define RXB0FILHIT3                      BANKMASK(RXB0CON), 3, a
#define RXB0FILHIT4                      BANKMASK(RXB0CON), 4, a
#define RXB0FUL                          BANKMASK(RXB0CON), 7, a
#define RXB0IF                           BANKMASK(PIR3), 0, a
#define RXB0IP                           BANKMASK(IPR3), 0, a
#define RXB0M0                           BANKMASK(RXB0CON), 5, a
#define RXB0M1                           BANKMASK(RXB0CON), 6, a
#define RXB0OVFL                         BANKMASK(COMSTAT), 7, a
#define RXB0OVFL_NOT_FIFOEMPTY           BANKMASK(COMSTAT), 7, a
#define RXB0OVFL_nFIFOEMPTY              BANKMASK(COMSTAT), 7, a
#define RXB0RB0                          BANKMASK(RXB0DLC), 4, a
#define RXB0RB1                          BANKMASK(RXB0DLC), 5, a
#define RXB0RTR                          BANKMASK(RXB0DLC), 6, a
#define RXB0RTRR0                        BANKMASK(RXB0CON), 3, a
#define RXB0RTRRO                        BANKMASK(RXB0CON), 5, a
#define RXB0SID0                         BANKMASK(RXB0SIDL), 5, a
#define RXB0SID1                         BANKMASK(RXB0SIDL), 6, a
#define RXB0SID10                        BANKMASK(RXB0SIDH), 7, a
#define RXB0SID2                         BANKMASK(RXB0SIDL), 7, a
#define RXB0SID3                         BANKMASK(RXB0SIDH), 0, a
#define RXB0SID4                         BANKMASK(RXB0SIDH), 1, a
#define RXB0SID5                         BANKMASK(RXB0SIDH), 2, a
#define RXB0SID6                         BANKMASK(RXB0SIDH), 3, a
#define RXB0SID7                         BANKMASK(RXB0SIDH), 4, a
#define RXB0SID8                         BANKMASK(RXB0SIDH), 5, a
#define RXB0SID9                         BANKMASK(RXB0SIDH), 6, a
#define RXB0SRR                          BANKMASK(RXB0SIDL), 4, a
#define RXB1D00                          BANKMASK(RXB1D0), 0, b
#define RXB1D01                          BANKMASK(RXB1D0), 1, b
#define RXB1D02                          BANKMASK(RXB1D0), 2, b
#define RXB1D03                          BANKMASK(RXB1D0), 3, b
#define RXB1D04                          BANKMASK(RXB1D0), 4, b
#define RXB1D05                          BANKMASK(RXB1D0), 5, b
#define RXB1D06                          BANKMASK(RXB1D0), 6, b
#define RXB1D07                          BANKMASK(RXB1D0), 7, b
#define RXB1D10                          BANKMASK(RXB1D1), 0, b
#define RXB1D11                          BANKMASK(RXB1D1), 1, b
#define RXB1D12                          BANKMASK(RXB1D1), 2, b
#define RXB1D13                          BANKMASK(RXB1D1), 3, b
#define RXB1D14                          BANKMASK(RXB1D1), 4, b
#define RXB1D15                          BANKMASK(RXB1D1), 5, b
#define RXB1D16                          BANKMASK(RXB1D1), 6, b
#define RXB1D17                          BANKMASK(RXB1D1), 7, b
#define RXB1D20                          BANKMASK(RXB1D2), 0, b
#define RXB1D21                          BANKMASK(RXB1D2), 1, b
#define RXB1D22                          BANKMASK(RXB1D2), 2, b
#define RXB1D23                          BANKMASK(RXB1D2), 3, b
#define RXB1D24                          BANKMASK(RXB1D2), 4, b
#define RXB1D25                          BANKMASK(RXB1D2), 5, b
#define RXB1D26                          BANKMASK(RXB1D2), 6, b
#define RXB1D27                          BANKMASK(RXB1D2), 7, b
#define RXB1D30                          BANKMASK(RXB1D3), 0, b
#define RXB1D31                          BANKMASK(RXB1D3), 1, b
#define RXB1D32                          BANKMASK(RXB1D3), 2, b
#define RXB1D33                          BANKMASK(RXB1D3), 3, b
#define RXB1D34                          BANKMASK(RXB1D3), 4, b
#define RXB1D35                          BANKMASK(RXB1D3), 5, b
#define RXB1D36                          BANKMASK(RXB1D3), 6, b
#define RXB1D37                          BANKMASK(RXB1D3), 7, b
#define RXB1D40                          BANKMASK(RXB1D4), 0, b
#define RXB1D41                          BANKMASK(RXB1D4), 1, b
#define RXB1D42                          BANKMASK(RXB1D4), 2, b
#define RXB1D43                          BANKMASK(RXB1D4), 3, b
#define RXB1D44                          BANKMASK(RXB1D4), 4, b
#define RXB1D45                          BANKMASK(RXB1D4), 5, b
#define RXB1D46                          BANKMASK(RXB1D4), 6, b
#define RXB1D47                          BANKMASK(RXB1D4), 7, b
#define RXB1D50                          BANKMASK(RXB1D5), 0, b
#define RXB1D51                          BANKMASK(RXB1D5), 1, b
#define RXB1D52                          BANKMASK(RXB1D5), 2, b
#define RXB1D53                          BANKMASK(RXB1D5), 3, b
#define RXB1D54                          BANKMASK(RXB1D5), 4, b
#define RXB1D55                          BANKMASK(RXB1D5), 5, b
#define RXB1D56                          BANKMASK(RXB1D5), 6, b
#define RXB1D57                          BANKMASK(RXB1D5), 7, b
#define RXB1D60                          BANKMASK(RXB1D6), 0, b
#define RXB1D61                          BANKMASK(RXB1D6), 1, b
#define RXB1D62                          BANKMASK(RXB1D6), 2, b
#define RXB1D63                          BANKMASK(RXB1D6), 3, b
#define RXB1D64                          BANKMASK(RXB1D6), 4, b
#define RXB1D65                          BANKMASK(RXB1D6), 5, b
#define RXB1D66                          BANKMASK(RXB1D6), 6, b
#define RXB1D67                          BANKMASK(RXB1D6), 7, b
#define RXB1D70                          BANKMASK(RXB1D7), 0, b
#define RXB1D71                          BANKMASK(RXB1D7), 1, b
#define RXB1D72                          BANKMASK(RXB1D7), 2, b
#define RXB1D73                          BANKMASK(RXB1D7), 3, b
#define RXB1D74                          BANKMASK(RXB1D7), 4, b
#define RXB1D75                          BANKMASK(RXB1D7), 5, b
#define RXB1D76                          BANKMASK(RXB1D7), 6, b
#define RXB1D77                          BANKMASK(RXB1D7), 7, b
#define RXB1DLC0                         BANKMASK(RXB1DLC), 0, b
#define RXB1DLC1                         BANKMASK(RXB1DLC), 1, b
#define RXB1DLC2                         BANKMASK(RXB1DLC), 2, b
#define RXB1DLC3                         BANKMASK(RXB1DLC), 3, b
#define RXB1EID0                         BANKMASK(RXB1EIDL), 0, b
#define RXB1EID1                         BANKMASK(RXB1EIDL), 1, b
#define RXB1EID10                        BANKMASK(RXB1EIDH), 2, b
#define RXB1EID11                        BANKMASK(RXB1EIDH), 3, b
#define RXB1EID12                        BANKMASK(RXB1EIDH), 4, b
#define RXB1EID13                        BANKMASK(RXB1EIDH), 5, b
#define RXB1EID14                        BANKMASK(RXB1EIDH), 6, b
#define RXB1EID15                        BANKMASK(RXB1EIDH), 7, b
#define RXB1EID16                        BANKMASK(RXB1SIDL), 0, b
#define RXB1EID17                        BANKMASK(RXB1SIDL), 1, b
#define RXB1EID2                         BANKMASK(RXB1EIDL), 2, b
#define RXB1EID3                         BANKMASK(RXB1EIDL), 3, b
#define RXB1EID4                         BANKMASK(RXB1EIDL), 4, b
#define RXB1EID5                         BANKMASK(RXB1EIDL), 5, b
